index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-21 Tue 12:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The DuPont Identity</title>
<meta name="author" content="Matt Brigida, Ph.D." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">The DuPont Identity</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org24d2bd7">1. Derivation</a>
<ul>
<li><a href="#orgbb2e131">1.1. The First Step: ROA</a></li>
<li><a href="#org5707b1b">1.2. DuPont Identity</a></li>
</ul>
</li>
<li><a href="#orgc651a3c">2. Application</a></li>
<li><a href="#orgad314d3">3. Self-Quiz Questions</a></li>
<li><a href="#org6adfd82">4. Reading Ease Score</a></li>
</ul>
</div>
</div>
<p>
The DuPont Identity breaks Return-on-Equity (ROE) into 3 separate components, the Profit Margin (PM), Total Asset Turnover (TAT) and the Equity Multiplier (EM).
</p>

<div id="outline-container-org24d2bd7" class="outline-2">
<h2 id="org24d2bd7"><span class="section-number-2">1.</span> Derivation</h2>
<div class="outline-text-2" id="text-1">
<p>
We'll first state <i>ROE</i> in terms of <i>ROA</i> because it gives and important insight for using each as a measure of management performance.  
</p>
</div>

<div id="outline-container-orgbb2e131" class="outline-3">
<h3 id="orgbb2e131"><span class="section-number-3">1.1.</span> The First Step: ROA</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Let <i>NI</i> denote Net Income, <i>E</i> denote equity, and <i>A</i> denote assets.  <i>ROA</i> is Return-on-Assets.  
</p>

<p>
\[ROE = \frac{NI}{E} = \frac{NI}{A}(\frac{A}{E}) = ROA(EM)\]
</p>

<p>
This is not yet the DuPont Identity, but it does show us something very
useful.  <i>ROE</i> is equal to <i>ROA</i> multiplied by a measure of the firm's
capital structure.  Remember <i>EM</i> is the firm's debt-to-equity ratio plus 1.  
</p>

<p>
The important point here is managers can change <i>EM</i> easily.  In fact if they
want to increase <i>EM</i> (and thereby likely<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> increase <i>ROE</i>) they just have to
issue debt and buy back stock. We will see <i>ROA</i> is solely a function of
operating measure of the firm, and cannot easily be changed by management.
</p>

<p>
So if you were to measure management performance would you use the measure that management can easily increase or decrease via the capital structure?  Or would you use the measure of operating performace they cannot easily
change?
</p>
</div>
</div>

<div id="outline-container-org5707b1b" class="outline-3">
<h3 id="org5707b1b"><span class="section-number-3">1.2.</span> DuPont Identity</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Decomposing <i>ROA</i>:
</p>

<p>
\[ROA = \frac{NI}{A} = \frac{NI}{S}(\frac{S}{A}) = PM(TAT)\]
</p>

<p>
where <i>S</i> denotes sales, and <i>PM</i> and <i>TAT</i> is profit margin and total asset turnover respectively.  Inserting this into the <i>ROE</i> equation above affords:
</p>

<p>
\[ROE = PM(TAT)(EM)\]
</p>

<p>
which is the DuPont Identity.  It says that a firm's return on equity is the product of the firm's profit margin, total asset turnover, and equity multiplier.  
</p>
</div>
</div>
</div>

<div id="outline-container-orgc651a3c" class="outline-2">
<h2 id="orgc651a3c"><span class="section-number-2">2.</span> Application</h2>
<div class="outline-text-2" id="text-2">
<p>
This is particularly useful when you realize that profit margin measures a firm's profitability.  That is, it measures how well a firm controls its costs.  Total asset turnover, however, measures how efficiently a firms uses its assets.  Lastly, the equity multiplier (which is one plus the debt-to-equity ratio) is a measure of the firm's use of debt in its capital structure.
</p>

<p>
So the DuPont Identity allows you to see what is driving a firm's <i>ROE</i>.  Does the firm have a high <i>ROE</i> because it controls is costs, or because it uses its assets efficiently?  Or does it simply have a high <i>ROE</i> because it is highly leveraged (not a particularly good reason).
</p>

<blockquote>
<p>
Author note:  I once was asked by upper management for an analysis of the performance of our wind farms in north Texas.  While going through their financial statements I realized I had everything I needed to calculate the DuPont Identity.  I was thus able to point to profitability as the driver of our wind farm returns.
</p>
</blockquote>



<script>

var calculate = function() {

  var PM = Number(document.getElementById("PM").value);
  var TAT = Number(document.getElementById("TAT").value);
  var DE = Number(document.getElementById("DE").value);

  var roe = PM * TAT * (1 + DE);
  
  document.getElementById("out_roe").innerHTML = roe.toFixed(4);

}

</script>

<body class="all">
  <h3>
    ROE (DuPont) Calculator
  </h3>

  <div class="row">

    <div class="column">
      <table style="width:100%">
        <tr>
          <th align="left">Profit Margin:</th>
          <th><input id="PM" value="0.08" style="width: 50px"></th>
        </tr>
        <tr>
          <th align="left">Total Asset Turnover:</th>
          <th><input id="TAT" value="1.3" style="width: 50px"></th>
        </tr>
        <tr>
          <th align="left">Debt-to-Equity Ratio:</th>
          <th><input id="DE" value="0.5" style="width: 50px"></th>
        </tr>
      </table>
      <button onclick="calculate()">
        Calculate.
      </button>
    </div>

    <div class="column">
    <p><b>ROE: <span id="out_roe"></span></b></p>
    </div>

  </div>
  <br>
  <br>
  <br>
</body>
</div>
</div>



<div id="outline-container-orgad314d3" class="outline-2">
<h2 id="orgad314d3"><span class="section-number-2">3.</span> Self-Quiz Questions</h2>
<div class="outline-text-2" id="text-3">
<script>
var submitAnswer1 = function() {

  var radios = document.getElementsByName('choice');
  var val= "";
  for (var i = 0, length = radios.length; i < length; i++) {
      if (radios[i].checked) {
         val = radios[i].value; 
         break;
       }
  }
  
  if (val == "" ) {
   // alert('please select choice answer');
document.getElementById("p1").innerHTML = "Choose your answer.";
document.getElementById("p1").style.backgroundColor = "white";
  } else if ( val == "Correct" ) {
//    alert('Answer is correct !');
document.getElementById("p1").innerHTML = "Correct!";
document.getElementById("p1").style.backgroundColor = "#90EE90";
  } else {
//    alert('Answer is wrong');
document.getElementById("p1").innerHTML = "Wrong";
document.getElementById("p1").style.backgroundColor = "#ff6666";
  }
};
</script>



<p>1. Assume Mohawk Valley Skateboards has a 10% profit margin, 1.6 in total asset turnover, and a 1.75 equity multiplier.  What is the firm's return on equity?</p>
<form >
<input type="radio" name="choice" value="Incorrect"> 4%<br>
<input type="radio" name="choice" value="Correct"> 28%<br>
<input type="radio" name="choice" value="Incorrect"> 36%<br>
<input type="radio" name="choice" value="Incorrect"> 55%
</form>
<button onclick="submitAnswer1()">Submit Answer</button>
<span id="p1"></span>
<br>


<script>
var submitAnswer2 = function() {

  var radios = document.getElementsByName('choice2');
  var val= "";
  for (var i = 0, length = radios.length; i < length; i++) {
      if (radios[i].checked) {
         val = radios[i].value; 
         break;
       }
  }
  
  if (val == "" ) {
   // alert('please select choice answer');
document.getElementById("p2").innerHTML = "Choose your answer.";
document.getElementById("p2").style.backgroundColor = "white";
  } else if ( val == "Correct" ) {
//    alert('Answer is correct !');
document.getElementById("p2").innerHTML = "Correct!";
document.getElementById("p2").style.backgroundColor = "#90EE90";
  } else {
//    alert('Answer is wrong');
document.getElementById("p2").innerHTML = "Wrong";
document.getElementById("p2").style.backgroundColor = "#ff6666";
  }
};
</script>


<br>
<p>2. New Hartford Paving Inc has a 10% profit margin, a 30% return on equity, and a debt-to-equity ratio of 1.2?  What is the firm's total asset turnover?</p>
<form >
<input type="radio" name="choice2" value="Correct"> 1.36<br>
<input type="radio" name="choice2" value="Incorrect"> 1.77<br>
<input type="radio" name="choice2" value="Incorrect"> 2.2<br>
<input type="radio" name="choice2" value="Incorrect"> 5.12
</form>
<button onclick="submitAnswer2()">Submit Answer</button>
<span id="p2"></span>

<script>
var submitAnswer3 = function() {

  var radios = document.getElementsByName('choice3');
  var val= "";
  for (var i = 0, length = radios.length; i < length; i++) {
      if (radios[i].checked) {
         val = radios[i].value; 
         break;
       }
  }
  
  if (val == "" ) {
   // alert('please select choice answer');
document.getElementById("p3").innerHTML = "Choose your answer.";
document.getElementById("p3").style.backgroundColor = "white";
  } else if ( val == "Correct" ) {
//    alert('Answer is correct !');
document.getElementById("p3").innerHTML = "Correct!";
document.getElementById("p3").style.backgroundColor = "#90EE90";
  } else {
//    alert('Answer is wrong');
document.getElementById("p3").innerHTML = "Wrong";
document.getElementById("p3").style.backgroundColor = "#ff6666";
  }
};
</script>


<br>
<p>3.  If a firm has a 15% return on assets and a debt to equity ratio of 2, what is its return on equity?</p>
<form >
<input type="radio" name="choice3" value="Incorrect"> 15%<br>
<input type="radio" name="choice3" value="Incorrect"> 25%<br>
<input type="radio" name="choice3" value="Incorrect"> 33%<br>
<input type="radio" name="choice3" value="Correct"> 45%
</form>
<button onclick="submitAnswer3()">Submit Answer</button>
<span id="p3"></span>
</div>
</div>

<div id="outline-container-org6adfd82" class="outline-2">
<h2 id="org6adfd82"><span class="section-number-2">4.</span> <a href="https://en.wikipedia.org/wiki/Flesch%25E2%2580%2593Kincaid_readability_tests">Reading Ease Score</a></h2>
<div class="outline-text-2" id="text-4">
<pre class="example">

"Flesch-Kincaid reading ease score: 76.38 Fairly easy (7th grade)"
</pre>


<pre class="example">

"Flesch-Kincaid grade level score: 4.95"
</pre>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
There are unlikely situations where increasing a firm's <i>EM</i> will decrease <i>ROE</i> because the effect of interest expense on reducing <i>PM</i> more than offsets the increase in the debt-to-equity ratio.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2022-06-21 Tue 12:48</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
